This is a list of the current branches for the DoseSpot project, and how they relate to each other.

*** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/3954][WE-480]]: Replace "AddPrescriptionsByFreeText" functions with new service method
- Note taken on [2024-05-03 Fri 11:07] \\
  Error fixed, I mixed up the refills quantity with the dispense quantity
- Note taken on [2024-05-03 Fri 10:53] \\
  QA found an error with this one, where a 0 in the "refills" field will cause an error
:LOGBOOK:
CLOCK: [2024-05-03 Fri 10:53]--[2024-05-03 Fri 11:18] =>  0:25
:END:
- Note taken on [2024-05-02 Thu 18:09] \\
  In QA
- Note taken on [2024-04-29 Mon 17:23] \\
  In review
- Note taken on [2024-04-15 Mon 16:46] \\
  Waiting for WE-583 to be merged, then this one can be reviewed.
*** [X] WE-374: "ChangePrescriptionPharmacy" service method.
- Note taken on [2024-04-24 Wed 13:15] \\
  Ready to merge
- Note taken on [2024-04-16 Tue 13:14] \\
  Needs a few more tests before being marked as ready for review.
- Note taken on [2024-04-15 Mon 16:46] \\
  Waiting for WE-583 to be merged, then this one can be reviewed.
:LOGBOOK:
CLOCK: [2024-04-15 Mon 11:17]--[2024-04-15 Mon 11:42] =>  0:25
CLOCK: [2024-04-15 Mon 10:39]--[2024-04-15 Mon 11:04] =>  0:25
:END:
*** [X] WE-469: Create "AddPrescriptionsByCode" for DoseSpot V2
- Note taken on [2024-05-14 Tue 08:14] \\
  In review
- Note taken on [2024-05-10 Fri 12:15] \\
  Need to test this one myself, might be ready for review.
- Note taken on [2024-05-06 Mon 15:01] \\
  Cannot test the UI portion of this until WE-485 is complete
:LOGBOOK:
CLOCK: [2024-05-02 Thu 11:39]--[2024-05-02 Thu 12:04] =>  0:25
CLOCK: [2024-05-02 Thu 10:52]--[2024-05-02 Thu 11:17] =>  0:25
:END:
*** [X] WE-486: Create "SearchPharmacy" for DoseSpot V2
- Note taken on [2024-05-03 Fri 15:44] \\
  In review
:LOGBOOK:
CLOCK: [2024-05-03 Fri 14:16]--[2024-05-03 Fri 14:41] =>  0:25
CLOCK: [2024-05-03 Fri 12:15]--[2024-05-03 Fri 12:40] =>  0:25
CLOCK: [2024-05-03 Fri 11:27]--[2024-05-03 Fri 11:52] =>  0:25
CLOCK: [2024-05-03 Fri 10:03]--[2024-05-03 Fri 10:28] =>  0:25
:END:
** [18/18] WE-576: Refactor the ERxService method interfaces to accept Provider IDs instead of Provider DoseSpot IDs
:LOGBOOK:
CLOCK: [2024-04-04 Thu 11:27]--[2024-04-04 Thu 11:52] =>  0:25
CLOCK: [2024-04-04 Thu 10:55]--[2024-04-04 Thu 11:20] =>  0:25
CLOCK: [2024-04-04 Thu 10:16]--[2024-04-04 Thu 10:41] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WE-624][feat/WE-624]]: Refactor Coded Prescriptions
:LOGBOOK:
CLOCK: [2024-05-02 Thu 09:05]--[2024-05-02 Thu 09:20] =>  0:15
CLOCK: [2024-05-02 Thu 08:35]--[2024-05-02 Thu 09:00] =>  0:25
:END:
*** [X] Clinician
No changes
:LOGBOOK:
CLOCK: [2024-05-08 Wed 11:54]--[2024-05-08 Wed 11:57] =>  0:03
:END:
